[
  {
    "question": "Guess the next number in the series: 21, 26, 34, 45, __?"
  },
  {
    "question": "Mrs. Romi Lancer decided to treat her neighbours in the manner that she gives one-third of his total stock of candies and one extra to the first neighbour, and then the one-third of the remaining stock along with one extra to the second and continues giving away in this fashion. Her total stock exhausted after she gave away to 7 neighbours. How many candies were there in her stock initially?"
  },
  {
    "question": "Two cars begin 450 miles apart and begin driving directly toward each other. One car proceeds at a rate of 60 miles per hour, while the other proceeds at a rate of 45 miles per hour. Rounding down, many minutes will it take for the two drivers to be 150 miles apart?"
  },
  {
    "question": "The population of Rio de Janeiro increased from 1.5 million in the year 2009 to 2.5 million in 2021 and the gross domestic product of the city in 2009 was 61 less than that in 2021. What was the approximate percent change, in the per capita gross domestic product of the city from 2009 to 2021?"
  },
  {
    "question": "Alina bought 21 candles and labelled them with same selling price. She sells 12 candles initially at 25% discount on the labeled price. Then she sells the remaining 9 candles at an additional 30% discount on the discounted price. Thus, she gets a total of Rs 3382, and makes a 15% profit. With no discounts, her percentage of profit would have been?"
  },
  {
    "question": "Asgard city is 13 Km. towards the East of Vormir city. A bus starts from Vormir travels 8 Km. towards West and takes a right turn. After taking the right turn, it travels 4.5 Km. and reaches Titan city. From Titan the bus takes a right turn again, travels 21 Km. and stops. How far and towards which direction must the travel to reach Asgard?"
  },
  {
    "question": "Guess the number (in place of ?) in the series: 2, 12, 43, 235, ? , 6702."
  },
  {
    "question": "John sold a pair of toys (Doraemon and Superman) at 25% profit. The profit obtained from Doraemon was 20%. If he reduced the both cost price of the Doraemon and selling price of the Doraemon by $200, his profit on the pair would have risen to 30%. Earlier cost price of the Superman was $80 less than half of the selling price of the Doraemon. What price should he mark on a pair of Doraemon and Superman to earn a profit of 50%?"
  },
  {
    "question": "Stevan is twice as old as David. He will be twice as old as Martin in 10 years. If Martin is 2 years old, how old is David?"
  },
  {
    "question": "The number of solutions (a, b, c) to the equation a - b - c = 37, where a, b, and c are positive integers such that a≤35, b≤17, and c≤17 is?"
  }
]
