[
  {
    "question": "A boy starting from his home, travels 6 km towards east, then turning to his left he travels 6 km in that direction. After this he again turns left and travels 6 km. How far is the boy now from his home?"
  },
  {
    "question": "What should be the next number (in place of ?) in the series: 2, 3, 7, 16, 32, 57, ?"
  },
  {
    "question": "Alina and Luce can do a piece of work in 36 days and 81 days respectively. Both together work for 5 days and then Alina leaves off. How many days will Luce take to finish the remaining work?"
  },
  {
    "question": "Students in a college have to choose at least two subjects from chemistry, mathematics and physics. The number of students choosing all three subjects is 18, choosing physics as one of their subjects is 23 and choosing mathematics as one of their subjects is 25. The smallest possible number of students who could choose chemistry as one of their subjects is?"
  },

  {
    "question": "While going on vacation by car, Adam travels the first 4 hours at 50mph speed and the remaining 6 hours at 25mph. Calculate the average speed of Adam in mph?"
  },
  {
    "question": "Vincent and Rosetta finally started their long planned farming business. Vincent invested $4332 for 18 months and Rosetta invested $3000 for 13 months. If both of them earned a profit of $2500 after 18 months then what is the profit share of Vincent?"
  },
  {
    "question": "Stevan is 2-times as old as David. Stevan will be 3-times as old as Martin in 2 years. If Martin is 10 years old currently, what will be the summation of their ages (all three) after 10 years?"
  },
  {
    "question": "A gentleman decided to treat a few children in the following manner. He gives half of his total stock of toffees and one extra to the first child, and then the half of the remaining stock along with one extra to the second and continues giving away in this fashion. His total stock exhausts after he takes care of 5 children. How many toffees were there in his stock initially?"
  },
  {
    "question": "The word DAF is coded as 614 in a specific code language. In the same language, HIG will be coded as ___?"
  }
]
